const cyrillicToGlagolitic = {
    //교회슬라브어에서 쓰이는 키릴 문자 추가 예정
    //글라골에선 е랑 э가 통일되어 있음.
    //대문자
    'А': 'Ⰰ', 'Б': 'Ⰱ', 'В': 'Ⰲ', 'Г': 'Ⰳ', 'Д': 'Ⰴ',
    'Е': 'Ⰵ', 'Ж': 'Ⰶ', 'З': 'Ⰸ', 'И': 'Ⰻ', 'Й': 'Ⰻ',
    'К': 'Ⰽ', 'Л': 'Ⰾ', 'М': 'Ⰿ', 'Н': 'Ⱀ', 'О': 'Ⱁ',
    'П': 'Ⱂ', 'Р': 'Ⱃ', 'С': 'Ⱄ', 'Т': 'Ⱅ', 'У': 'Ⱆ',
    'Ф': 'Ⱇ', 'Х': 'Ⱈ', 'Ц': 'Ⱌ', 'Ч': 'Ⱍ', 'Ш': 'Ⱎ',
    'Щ': 'Ⱋ', 'Ъ': 'Ⱏ', 'Ь': 'Ⱐ	', 'Э': 'Ⰵ',
    'Ю': 'Ⱓ', 'Я': 'Ⱑ', 
    //소문자
    'а': 'ⰰ', 'б': 'ⰱ', 'в': 'ⰲ','г': 'ⰳ', 'д': 'ⰴ',
    'е': 'ⰵ', 'ж': 'ⰶ', 'з': 'ⰸ','и': 'ⰻ', 'й': 'ⰻ',
    'к': 'ⰽ', 'л': 'ⰾ', 'м': 'ⰿ', 'н': 'ⱀ', 'о': 'ⱁ',
    'п': 'ⱂ', 'р': 'ⱃ', 'с': 'ⱄ','т': 'ⱅ', 'у': 'ⱆ',
    'ф': 'ⱇ', 'х': 'ⱈ', 'ц': 'ⱌ','ч': 'ⱍ', 'ш': 'ⱎ',
    'щ': 'ⱋ', 'ъ': 'ⱏ', 'ь': 'ⱐ', 'э': 'ⰵ', 
    'ю': 'ⱓ', 'я': 'ⱑ',
    //Ⰷ	이거 니혼고 ち의 ㅊ 발음남.
    //임시
    'ё': 'Ⱖ',
    'ы': 'ⱏⰹ',
    'ё': 'ⱖ',
    'Ы': 'ⰟⰉ',

    //교회 슬라브용
    'Ѣ':'Ⱑ', 
    'ѣ':'ⱑ',
    'Ꙗ': 'Ⱑ',
    'ꙗ': 'ⱑ',
    'Ѧ': 'Ⱔ',
    'ѧ': 'ⱔ',
    'Ѩ': 'Ⱗ',
    'ѩ':'ⱗ',
    'Ѫ': 'Ⱘ',
    'ѫ': 'ⱘ',
    'Ѭ': 'Ⱙ',
    'ѭ': 'ⱙ',
    'Ѥ': 'Ⰵ',
    'ѥ': 'ⰵ',
    'Є': 'Ⰵ',
    'є': 'ⰵ',
    'Ꙋ': 'Ⱆ',
    'ꙋ': 'ⱆ',
    'Ꙑ': 'ⰟⰊ',
    'ꙑ':'ⱏⰹ',
    'Ꙁ': 'ⰸ',
    'ꙁ': 'Ⰸ',

    'Ꙓ' : 'ⰋⰡ',
    'ꙓ': 'ⰻⰺ'

};

const gana = { 
    //내 맘대로 옮김
    'あ': 'ⰰ', 'い': 'ⰻ', 'う': 'ⱆ', 'え': 'ⰵ', 'お': 'ⱁ',
    'ア': 'ⰰ', 'イ': 'ⰻ', 'ウ': 'ⱆ', 'エ': 'ⰵ', 'オ': 'ⱁ',
    'か': 'ⰽⰰ', 'き': 'ⰽⰻ', 'く': 'ⰽⱆ', 'け': 'ⰽⰵ', 'こ': 'ⰽⱁ',
    'カ': 'ⰽⰰ', 'キ': 'ⰽⰻ', 'ク': 'ⰽⱆ', 'ケ': 'ⰽⰵ', 'コ': 'ⰽⱁ',
    'さ': 'ⱄⰰ', 'し': 'ⱋⰻ', 'す': 'ⱄⱏⰹ', 'せ': 'ⱄⰵ', 'そ': 'ⱄⱁ', //し를 ши로 표기. ㅡ 계열은 ⱏⰹ(ы)로 옮김.
    'サ': 'ⱄⰰ', 'シ': 'ⱋⰻ', 'ス': 'ⱄⱏⰹ', 'セ': 'ⱄⰵ', 'ソ': 'ⱄⱁ',
    'た': 'ⱅⰰ', 'ち': 'ⱍⰻ', 'つ': 'ⱌⱏⰹ', 'て': 'ⱅⰵ', 'と': 'ⱅⱁ', //Ⰷ이거 니혼고 ㅊ 발음남, つ를 цу로 표기. 
    'タ': 'ⱅⰰ', 'チ': 'ⱍⰻ', 'ツ': 'ⱌⱏⰹ', 'テ': 'ⱅⰵ', 'ト': 'ⱅⱁ',
    'な': 'ⱀⰰ', 'に': 'ⱀⰻ', 'ぬ': 'ⱀⱆ', 'ね': 'ⱀⰵ', 'の': 'ⱀⱁ',
    'ナ': 'ⱀⰰ', 'ニ': 'ⱀⰻ', 'ヌ': 'ⱀⱆ', 'ネ': 'ⱀⰵ', 'ノ': 'ⱀⱁ',
    'は': 'ⱈⰰ', 'ひ': 'ⱈⰻ', 'ふ': 'ⱈⱆ', 'へ': 'ⱈⰵ', 'ほ': 'ⱈⱁ',
    'ハ': 'ⱈⰰ', 'ヒ': 'ⱈⰻ', 'フ': 'ⱇⱆ', 'ヘ': 'ⱈⰵ', 'ホ': 'ⱈⱁ', //ふ는 ху로, フ는 фу로 표기.
    'ま': 'ⰿⰰ', 'み': 'ⰿⰻ', 'む': 'ⰿⱆ', 'め': 'ⰿⰵ', 'も': 'ⰿⱁ',
    'マ': 'ⰿⰰ', 'ミ': 'ⰿⰻ', 'ム': 'ⰿⱆ', 'メ': 'ⰿⰵ', 'モ': 'ⰿⱁ',
    'や': 'ⱑ', 'ゆ': 'ⱓ', 'よ': 'ⱖ',
    'ヤ': 'ⱑ', 'ユ': 'ⱓ', 'ヨ': 'ⱖ',
    'ら': 'ⱃⰰ', 'り': 'ⱃⰻ', 'る': 'ⱃⱆ', 'れ': 'ⱃⰵ', 'ろ': 'ⱃⱁ',
    'ラ': 'ⱃⰰ', 'リ': 'ⱃⰻ', 'ル': 'ⱃⱆ', 'レ': 'ⱃⰵ', 'ロ': 'ⱃⱁ',
    'わ': 'ⰲⰰ', 'を': 'ⱁ', 'ん': 'ⱀⱏ',//ocs의 ⱏ(ъ)는 짧은 ㅜ 발음나긴 하는데 그래도 글자 구분 역할은 확실하게 해주니까 이거 쓰자.
    'ワ': 'ⰲⰰ', 'ヲ': 'ⱁ', 'ン': 'ⱀⱏ',

    //----탁음-----
    'が': 'ⰳⰰ', 'ぎ': 'ⰳⰻ', 'ぐ': 'ⰳⱆ', 'げ': 'ⰳⰵ', 'ご': 'ⰳⱁ',
    'ガ': 'ⰳⰰ', 'ギ': 'ⰳⰻ', 'グ': 'ⰳⱆ', 'ゲ': 'ⰳⰵ', 'ゴ': 'ⰳⱁ',
    'ざ': 'ⰴⰸⰰ', 'じ': 'ⰴⰸⰻ', 'ず': 'ⰴⰸⱆ', 'ぜ': 'ⰴⰸⰵ', 'ぞ': 'ⰴⰸⱁ',
    'ザ': 'ⰴⰸⰰ', 'ジ': 'ⰴⰸⰻ', 'ズ': 'ⰴⰸⱆ', 'ゼ': 'ⰴⰸⰵ', 'ゾ': 'ⰴⰸⱁ',
    'だ': 'ⰴⰰ', 'ぢ': 'ⰴⰸⰻ', 'づ': 'ⰴⱆ', 'で': 'ⰴⰵ', 'ど': 'ⰴⱁ',
    'ダ': 'ⰴⰰ', 'ヂ': 'ⰴⰸⰻ', 'ヅ': 'ⰴⱆ', 'デ': 'ⰴⰵ', 'ド': 'ⰴⱁ',
    'ば': 'ⰱⰰ', 'び': 'ⰱⰻ', 'ぶ': 'ⰱⱆ', 'べ': 'ⰱⰵ', 'ぼ': 'ⰱⱁ',
    'バ': 'ⰱⰰ', 'ビ': 'ⰱⰻ', 'ブ': 'ⰱⱆ', 'ベ': 'ⰱⰵ', 'ボ': 'ⰱⱁ',
    'ぱ': 'ⱂⰰ', 'ぴ': 'ⱂⰻ', 'ぷ': 'ⱂⱆ', 'ぺ': 'ⱂⰵ', 'ぽ': 'ⱂⱁ',
    'パ': 'ⱂⰰ', 'ピ': 'ⱂⰻ', 'プ': 'ⱂⱆ', 'ペ': 'ⱂⰵ', 'ポ': 'ⱂⱁ',
    //---------반모음 결합
    'きゃ': 'ⰽⱑ', 'きゅ': 'ⰽⱓ', 'きょ': 'ⰽⱖ',
    'キャ': 'ⰽⱑ', 'キュ': 'ⰽⱓ', 'キョ': 'ⰽⱖ',
    'しゃ': 'ⱄⱑ', 'しゅ': 'ⱄⱓ', 'しょ': 'ⱄⱖ',
    'シャ': 'ⱄⱑ', 'シュ': 'ⱄⱓ', 'ショ': 'ⱄⱖ',
    'ちゃ': 'ⱍⱑ', 'ちゅ': 'ⱍⱓ', 'ちょ': 'ⱍⱖ',
    'チャ': 'ⱍⱑ', 'チュ': 'ⱍⱓ', 'チョ': 'ⱍⱖ',
    'にゃ': 'ⱀⱑ', 'にゅ': 'ⱀⱓ', 'にょ': 'ⱀⱖ',
    'ニャ': 'ⱀⱑ', 'ニュ': 'ⱀⱓ', 'ニョ': 'ⱀⱖ',
    'ひゃ': 'ⱈⱑ', 'ひゅ': 'ⱈⱓ', 'ひょ': 'ⱈⱖ',
    'ヒャ': 'ⱈⱑ', 'ヒュ': 'ⱈⱓ', 'ヒョ': 'ⱈⱖ',
    'みゃ': 'ⰿⱑ', 'みゅ': 'ⰿⱓ', 'みょ': 'ⰿⱖ',
    'ミャ': 'ⰿⱑ', 'ミュ': 'ⰿⱓ', 'ミョ': 'ⰿⱖ',
    'りゃ': 'ⱃⱑ', 'りゅ': 'ⱃⱓ', 'りょ': 'ⱃⱖ',
    'リャ': 'ⱃⱑ', 'リュ': 'ⱃⱓ', 'リョ': 'ⱃⱖ',
    'ぎゃ': 'ⰳⱑ', 'ぎゅ': 'ⰳⱓ', 'ぎょ': 'ⰳⱖ',
    'ギャ': 'ⰳⱑ', 'ギュ': 'ⰳⱓ', 'ギョ': 'ⰳⱖ',
    'じゃ': 'ⰴⰸⱑ', 'じゅ': 'ⰴⰸⱓ', 'じょ': 'ⰴⰸⱖ',
    'ジャ': 'ⰴⰸⱑ', 'ジュ': 'ⰴⰸⱓ', 'ジョ': 'ⰴⰸⱖ',
    'ぢゃ': 'ⰴⰸⱑ', 'ぢゅ': 'ⰴⰸⱓ', 'ぢょ': 'ⰴⰸⱖ',
    'ヂャ': 'ⰴⰸⱑ', 'ヂュ': 'ⰴⰸⱓ', 'ヂョ': 'ⰴⰸⱖ',
    'びゃ': 'ⰱⱑ', 'びゅ': 'ⰱⱓ', 'びょ': 'ⰱⱖ',
    'ビャ': 'ⰱⱑ', 'ビュ': 'ⰱⱓ', 'ビョ': 'ⰱⱖ',
    'ぴゃ': 'ⱂⱑ', 'ぴゅ': 'ⱂⱓ', 'ぴょ': 'ⱂⱖ',
    'ピャ': 'ⱂⱑ', 'ピュ': 'ⱂⱓ', 'ピョ': 'ⱂⱖ',
    'フィ':'ⱇⰻ',
    'フォ':'ⱇⱁ',
    'フェ':'ⱇⰵ',
    'ファ':'ⱇⰰ',
    'っ': 'ⰴⱏ', //ocs의 ⱏ(ъ)는 짧은 ㅜ 발음나긴 하는데 그래도 글자 구분 역할은 확실하게 해주니까 이거 쓰자.
    'ッ': 'ⰴⱏ', 

    'ティ': 'ⱅⰻ',
    'ディ':'ⰴⰻ',
    'テュ': 'ⱅⱓ', 
    'デュ':'ⰴⱓ', 
    'トゥ':'ⱅⱆ',
    'ドゥ':'ⰴⱆ',

    'ヴ': 'ⰲⱆ',
    'ヴァ' :'ⰲⰰ',
    'ヴィ':"ⰲⰻ",
    'ヴェ':"ⰲⰵ",
    'ヴォ':'ⰲⱁ',

    'ツァ':'ⱌⰰ',
    'ツィ':'ⱌⰻ',
    'ツェ':'ⱌⰵ',
    'ツォ':'ⱌⱁ',

    'ウィ': 'ⰲⰻ',
    'ウェ':'ⰲⰵ',
    'ウォ':'ⰲⱁ',

    'イェ': 'ⰵ',

    'スィ': 'ⱄⰻ',
    'ズィ': 'ⰸⰻ',
};

document.getElementById('input').addEventListener('keydown', (event) => {
    if (event.key === 'Enter') {
        convertText(); //엔터 눌렀을 때 텍스트 출력
    }
});

document.getElementById('convert-button').addEventListener('click', convertText); //제출 버튼 클릭했을 때 텍스트 출력

function convertText() {
    const input = document.getElementById('input').value; //입력값 가져옴

    let convertedInput = '';
    //let originalInput = '';
    for (let i = 0; i < input.length; i++) { //인풋 길이만큼 반복
        const char = input[i];
        convertedInput += gana[char] || cyrillicToGlagolitic[char] || char;
        //originalInput += char;
    }
    document.getElementById('output').textContent = convertedInput; //결과 출력
    //document.getElementById('original-input').textContent = input; //원문 출력
}
